/*
 * V4L2 SoC Camera driver for ST VS6725 Camera Sensor
 *
 * Copyright (C) 2011 ST Microelectronics
 * Bhupesh Sharma <bhupesh.sharma@st.com>
 *
 * Based on MT9M001 CMOS Image Sensor from Micron
 * Copyright (C) 2008, Guennadi Liakhovetski <kernel@pengutronix.de>
 *
 * This file is licensed under the terms of the GNU General Public
 * License version 2. This program is licensed "as is" without any
 * warranty of any kind, whether express or implied.
 */

#include <linux/delay.h>
#include <linux/device.h>
#include <linux/i2c.h>
#include <linux/log2.h>
#include <linux/pm.h>
#include <linux/slab.h>
#include <linux/videodev2.h>

#include <media/soc_camera.h>
#include <media/v4l2-chip-ident.h>
#include <media/v4l2-subdev.h>

/* vs6725 cropping windows params */
#define VS6725_MAX_WIDTH		1600
#define VS6725_MAX_HEIGHT		1200
#define VS6725_MIN_WIDTH		0
#define VS6725_MIN_HEIGHT		0
#define VS6725_COLUMN_SKIP		8
#define VS6725_ROW_SKIP			8

/* device parameters */
#define DEVICE_ID_HI			0x02
#define DEVICE_ID_LO			0xD5
#define FIRMWARE_VERSION		0x1
#define PATCH_VERSION			0

/* hsync, vsync related */
#define HSYNC_ENABLE			BIT(0)
#define HSYNC_POLARITY_ACTIVE_LO	(0 << 1)
#define HSYNC_POLARITY_ACTIVE_HI	BIT(1)
#define VSYNC_ENABLE			BIT(0)
#define VSYNC_POLARITY_ACTIVE_LO	(0 << 1)
#define VSYNC_POLARITY_ACTIVE_HI	BIT(1)

/* pclk related */
#define PCLK_PROG_POL_LO_INIT_LO	(0 << 0)
#define PCLK_PROG_POL_HI_INIT_LO	BIT(0)
#define PCLK_PROG_POL_LO_INIT_HI	BIT(1)
#define PCLK_PROG_POL_HI_INIT_HI	(BIT(1) | BIT(0))
#define PCLK_SYNC_EN			BIT(2)
#define PCLK_HSYNC_N			BIT(3)
#define PCLK_HSYNC_N_INTERNAL		BIT(4)
#define PCLK_VSYNC_N			BIT(5)
#define PCLK_VSYNC_N_INTERNAL		BIT(6)
#define PCLK_SYNC_INTERFRAME_EN		BIT(7)

/* view-live settings */
#define DISABLE_VIEW_LIVE		0
#define ENABLE_VIEW_LIVE		1

/* pipe info */
#define PIPE_0				0
#define PIPE_1				1

/* default zoom step sizes */
#define DEFAULT_ZOOM_STEP_SIZE_LO	0x01
#define DEFAULT_ZOOM_STEP_SIZE_HI	0

/* sensor mode */
#define UXGA_MODE			0
#define ANALOG_BINNING_MODE		1

/* frame rate mode */
#define MANUAL_FRAME_RATE		0
#define AUTO_FRAME_RATE			1

/* register write masks for HI and LO bytes */
#define WRITE_HI_BYTE(x)		((x) & 0xff)
#define WRITE_LO_BYTE(x)		(((x) & 0xff00) >> 8)

/* rgb flip shift */
#define RGB_FLIP_SHIFT(x)		((x) <<	1)

/* register address space */
#define USER_INTERFACE_REG_BASE		0x0
#define HARDWARE_REG_BASE		0xD900
#define LAST_REGISTER_ADDR		0xDA30

/* FIXME: find a better way of doing this */
#define SET_TO_ONE			1

/* vs6725 i2c write address is 0x20 */

/*
 * user-interface registers (firmware)
 */

/* vs6725 device parameter registers */
struct device_param {
	u8 device_id_hi;
	u8 device_id_lo;
	u8 fm_version;
	u8 patch_version;
};

/* vs6725 mode manager registers */
struct mode_manager {
	u8 user_cmd;
	u8 state;
	u8 active_pipe_bank;
	u8 view_live_en;
	u8 frames_streamed;
	u8 stream_length;
	u8 csi_en;
};

/* vs6725 zoom control registers */
struct zoom_control {
	u8 zoom_ctrl;
	u8 zoom_size_hi;
	u8 zoom_size_lo;
	u8 _reserved_zoom[13];
	u8 max_derating;
};

/* vs6725 pipe setup registers */
struct pipe_setup {
	u8 sensor_mode;
	u8 image_size;
	u8 manual_hs_hi;
	u8 manual_hs_lo;
	u8 manual_vs_hi;
	u8 manual_vs_lo;
	u8 data_format;
	u8 bayer_out_align;
	u8 channel_id;
	u8 gamma_r;
	u8 gamma_g;
	u8 gamma_b;
	u8 peaking_gain;
	u8 _reserved_pipe[3];
};

/* vs6725 pipe setup common registers */
struct pipe_setup_common {
	u8 contrast;
	u8 color_saturation;
	u8 brightness;
	u8 hori_mirror;
	u8 vert_flip;
};

/* vs6725 clock chain param FP inputs */
struct clock_chain_param {
	u8 ext_clock_freq_hi;
	u8 ext_clock_freq_lo;
	u8 pll_out_freq_hi;
	u8 pll_out_freq_lo;
	u8 e_div;
};

/* vs6725 static frame rate control registers */
struct static_frame_rate_ctrl {
	u8 des_frame_rate_num_hi;
	u8 des_frame_rate_num_lo;
	u8 des_frame_rate_den;
};

/* vs6725 static frame rate status registers */
struct static_frame_rate_sts {
	u8 req_frame_rate_hi;
	u8 req_frame_rate_lo;
	u8 max_frame_rate;
	u8 min_frame_rate;
};

/* vs6725 auto frame rate control registers */
struct auto_frame_rate_ctrl {
	u8 mode;
	u8 gain_thresh_lo_num;
	u8 gain_thresh_lo_den;
	u8 gain_thresh_hi_num;
	u8 gain_thresh_hi_den;
	u8 usr_min_frame_rate;
	u8 usr_max_frame_rate;
	u8 relative_change_num;
	u8 relative_change_den;
	u8 divorce_min_frame_rate;
};

/* vs6725 auto frame rate status registers */
struct auto_frame_rate_sts {
	u8 implied_gain_hi;
	u8 implied_gain_lo;
	u8 max_frame_len_lines_hi;
	u8 max_frame_len_lines_lo;
	u8 min_frame_len_lines_hi;
	u8 min_frame_len_lines_lo;
	u8 frame_len_change_lines_hi;
	u8 frame_len_change_lines_lo;
	u8 desired_auto_frame_rate_hi;
	u8 desired_auto_frame_rate_lo;
	u8 curr_frame_len_lines_hi;
	u8 curr_frame_len_lines_lo;
	u8 desired_frame_len_lines_hi;
	u8 desired_frame_len_lines_lo;
	u8 auto_frame_rate_stable;
	u8 auto_frame_rate_clip;
};

/* vs6725 exposure control registers */
struct exposure_ctrl {
	u8 mode;
	u8 metering;
	u8 manual_exp_time_num;
	u8 manual_exp_time_den;
	u8 manual_des_exp_time_hi;
	u8 manual_des_exp_time_lo;
	u8 cold_start_time_hi;
	u8 cold_start_time_lo;
	u8 exp_compensation;
	u8 misc_settings;
	u8 direct_mode_int_lines_hi;
	u8 direct_mode_int_lines_lo;
	u8 direct_mode_int_pixels_hi;
	u8 direct_mode_int_pixels_lo;
	u8 direct_mode_analog_gain_hi;
	u8 direct_mode_analog_gain_lo;
	u8 direct_mode_digital_gain_hi;
	u8 direct_mode_digital_gain_lo;
	u8 fg_mode_int_lines_hi;
	u8 fg_mode_int_lines_lo;
	u8 fg_mode_int_pixels_hi;
	u8 fg_mode_int_pixels_lo;
	u8 fg_mode_analog_gain_hi;
	u8 fg_mode_analog_gain_lo;
	u8 fg_mode_digital_gain_hi;
	u8 fg_mode_digital_gain_lo;
	u8 freeze_auto_exp;
	u8 usr_max_int_time_hi;
	u8 usr_max_int_time_lo;
	u8 rec_fg_thresh_hi;
	u8 rec_fg_thresh_lo;
	u8 _reserved_exp_ctrl;
	u8 anti_flicker_mode;
};

/* vs6725 exposure algo controls registers */
struct exposure_algo_ctrl {
	u8 digital_gain_ceiling_hi;
	u8 digital_gain_ceiling_lo;
};

/* vs6725 exposure status registers */
struct exposure_sts {
	u8 int_pending_lines_hi;
	u8 int_pending_lines_lo;
	u8 int_pending_pixels_hi;
	u8 int_pending_pixels_lo;
	u8 analog_gain_pending_hi;
	u8 analog_gain_pending_lo;
	u8 digital_gain_pending_hi;
	u8 digital_gain_pending_lo;
	u8 desired_exp_time_hi;
	u8 desired_exp_time_lo;
	u8 compiled_exp_time_hi;
	u8 compiled_exp_time_lo;
	u8 _reserved_exp_sts;
	u8 max_int_lines_hi;
	u8 max_int_lines_lo;
	u8 total_int_time_hi;
	u8 total_int_time_lo;
	u8 a_gain_pending_hi;
	u8 a_gain_pending_lo;
};

/* vs6725 flicker detect registers */
struct flicker_detect {
	u8 enb_detect;
	u8 detect_start;
	u8 flicker_id_thresh_hi;
	u8 flicker_id_thresh_lo;
	u8 win_times;
	u8 frame_rate_shift_no;
	u8 manual_fref_enb;
	u8 manual_fref100_hi;
	u8 manual_fref100_lo;
	u8 manual_fref120_hi;
	u8 manual_fref120_lo;
	u8 flicker_freq_hi;
	u8 flicker_freq_lo;
};

/* vs6725 white balance control registers */
struct white_bal_ctrl {
	u8 mode;
	u8 manu_red_gain;
	u8 manu_green_gain;
	u8 manu_blue_gain;
	u8 misc_settings;
	u8 hue_r_bias_hi;
	u8 hue_r_bias_lo;
	u8 hue_b_bias_hi;
	u8 hue_b_bias_lo;
	u8 flash_red_gain_hi;
	u8 flash_red_gain_lo;
	u8 flash_green_gain_hi;
	u8 flash_green_gain_lo;
	u8 flash_blue_gain_hi;
	u8 flash_blue_gain_lo;
};

/* vs6725 image stability registers */
struct image_stability {
	u8 white_bal_stable;
	u8 exp_stable;
	u8 _reserved_image_stb;
	u8 stable;
};

/* vs6725 exposure sensor constant registers */
struct exp_sensor_const {
	u8 sensor_a_gain_ceiling_hi;
	u8 sensor_a_gain_ceiling_lo;
};

/* vs6725 flash control registers */
struct flash_control {
	u8 flash_mode;
	u8 _reserved_flash_ctr[7];
	u8 flash_recommended;
};

/* vs6725 anti-vignettte registers */
struct anti_vignette {
	u8 disable;
};

/* vs6725 special effect control registers */
struct spl_effect_ctrl {
	u8 negative;
	u8 solarising;
	u8 sketch;
	u8 _reserved_spl_eff;
	u8 colour_effect;
};

/* vs6725 test pattern registers */
struct test_pattern {
	u8 enb_test_pattern;
	u8 test_pattern;
};

/*
 * low-level hardware registers
 */

/* vs6725 output format registers */
struct output_format {
	u8 opf_dctrl;
	u8 _reserved_out_fmt1[3];
	u8 opf_ycbcr_setup;
	u8 _reserved_out_fmt2[3];
	u8 opf_rgb_setup;
};

/* vs6725 output interface registers */
struct output_interface {
	u8 oif_hsync_setup;
	u8 _reserved_oi1[3];
	u8 oif_vsync_setup;
	u8 _reserved_oi2[31];
	u8 oif_pclk_setup;
};

struct vs6725_user_intf_regs {
	struct device_param dev_param;		/* 0x0000 to 0x0003 */
	u8 _reserved0[12];			/* 0x0004 to 0x000F */
	struct mode_manager mode_mgr;		/* 0x0010 to 0x0016 */
	u8 _reserved1[12];			/* 0x0017 to 0x001F */
	struct zoom_control zoom_ctrl;		/* 0x0020 to 0x0030 */
	u8 _reserved2[15];			/* 0x0031 to 0x003F */
	struct pipe_setup pipe[2];		/* [0]=pipe 0, [1]=pipe 1 */
	struct pipe_setup_common pipe_common;	/* 0x0060 to 0x0064 */
	u8 _reserved3[11];			/* 0x0065 to 0x006F */
	struct clock_chain_param clk_chn_param;	/* 0x0070 to 0x0074 */
	u8 _reserved4[27];			/* 0x0075 to 0x008F */
	struct static_frame_rate_ctrl stat_ctr;	/* 0x0090 to 0x0092 */
	u8 _reserved5[13];			/* 0x0093 to 0x009F */
	struct static_frame_rate_sts stat_sts;	/* 0x00A0 to 0x00A5 */
	u8 _reserved6[10];			/* 0x00A6 to 0x00AF */
	struct auto_frame_rate_ctrl auto_ctr;	/* 0x00B0 to 0x00B9 */
	u8 _reserved7[6];			/* 0x00BA to 0x00BF */
	struct auto_frame_rate_sts auto_sts;	/* 0x00C0 to 0x00CF */
	u8 _reserved8[32];			/* 0x00D0 to 0x00EF */
	struct exposure_ctrl exp_ctrl;		/* 0x00F0 to 0x0110 */
	u8 _reserved9[29];			/* 0x0111 to 0x012D */
	struct exposure_algo_ctrl exp_a_ctrl;	/* 0x012E to 0x012F */
	u8 _reserved10[36];			/* 0x0130 to 0x0153 */
	struct exposure_sts exp_sts;		/* 0x0154 to 0x0166 */
	u8 _reserved11[9];			/* 0x0167 to 0x016F */
	struct flicker_detect flick_detect;	/* 0x0170 to 0x017D */
	u8 _reserved12[2];			/* 0x017E to 0x017F */
	struct white_bal_ctrl wb_ctrl;		/* 0x0180 to 0x018E */
	u8 _reserved13[130];			/* 0x018F to 0x0210 */
	struct image_stability img_stability;	/* 0x0211 to 0x0214 */
	u8 _reserved14[29];			/* 0x0215 to 0x0231 */
	struct exp_sensor_const exp_sensor;	/* 0x0232 to 0x0233 */
	u8 _reserved15[12];			/* 0x0234 to 0x023F */
	struct flash_control flash_ctr;		/* 0x0240 to 0x0248 */
	u8 _reserved16[23];			/* 0x0249 to 0x025F */
	struct anti_vignette vignette;		/* 0x0260 */
	u8 _reserved17[95];			/* 0x0261 to 0x02BF */
	struct spl_effect_ctrl effect_ctr;	/* 0x02C0 to 0x02C4 */
	u8 _reserved18[95];			/* 0x02C5 to 0x049F */
	struct test_pattern test;		/* 0x04A0 to 0x04A1 */
};

struct vs6725_hardware_regs {
	struct output_format out_format;	/* 0xD900 to 0xD908 */
	u8 _reserved19[259];			/* 0xD909 to 0xDA0B */
	struct output_interface out_intf;	/* 0xDA0C to 0xDA30 */
};

struct vs6725 {
	struct v4l2_subdev subdev;
	int active_pipe;		/* whether pipe 0 or pipe 1 is active */
	int saturation;
	int contrast;
	int brightness;
	int gain;
	int awb;			/* automatic white balance */
	int aec;			/* automatic exposure control */
	int color_effect;		/* special color effect */
	int gamma;
	bool vflip;
	bool hflip;
	int model;			/* ident codes from v4l2-chip-ident.h */
	struct v4l2_rect rect;		/* sensor cropping window */
	enum v4l2_mbus_pixelcode code;
	enum v4l2_colorspace colorspace;
	struct vs6725_user_intf_regs *intf_regs;
	struct vs6725_hardware_regs *hw_regs;
};

enum vs6725_exposure_ctrl_mode {
	AUTOMATIC_MODE = 0,
	COMPILED_MANUAL_MODE,
	DIRECT_MANUAL_MODE,
	FLASHGUN_MODE,
};

enum vs6725_color_effects {
	COLOR_EFFECT_NORMAL = 0,
	COLOR_EFFECT_RED_ONLY,
	COLOR_EFFECT_YELLOW_ONLY,
	COLOR_EFFECT_GREEN_ONLY,
	COLOR_EFFECT_BLUE_ONLY,
	COLOR_EFFECT_BLACKNWHITE,
	COLOR_EFFECT_SEPIA,
